## Assignment - 1
## Name: G.Dheekshith Kumar 
## Reg No:21BPS1461
## Campus : Vit Chennai

### Task - 1

In [13]:
import pandas as pd
import numpy as np

In [14]:
d = {'Cars':['i10','i20','Creta','Venue'],'Lanch Year':['2011','2011','2015','2019'],'Price':['8.51','11.88','19.20',np.nan],'Tyre':['Bridge Stone','MRF','MRF','Bridge Stone']}
d

{'Cars': ['i10', 'i20', 'Creta', 'Venue'],
 'Lanch Year': ['2011', '2011', '2015', '2019'],
 'Price': ['8.51', '11.88', '19.20', nan],
 'Tyre': ['Bridge Stone', 'MRF', 'MRF', 'Bridge Stone']}

In [15]:
df = pd.DataFrame(d)
df

    Cars Lanch Year  Price          Tyre
0    i10       2011   8.51  Bridge Stone
1    i20       2011  11.88           MRF
2  Creta       2015  19.20           MRF
3  Venue       2019    NaN  Bridge Stone

In [16]:
df.shape #observation and features

(4, 4)

### Task - 2

In [17]:
df.rename(columns = {'Cars':'Random value 1', 'Lanch Year':'Random value 2',
                              'Price':'Random value 3','Tyre':'Random value 4'}, inplace = True)

In [18]:
df

  Random value 1 Random value 2 Random value 3 Random value 4
0            i10           2011           8.51   Bridge Stone
1            i20           2011          11.88            MRF
2          Creta           2015          19.20            MRF
3          Venue           2019            NaN   Bridge Stone

### Task - 3

In [19]:
df.describe()

       Random value 1 Random value 2 Random value 3 Random value 4
count               4              4              3              4
unique              4              3              3              2
top               i10           2011           8.51   Bridge Stone
freq                1              2              1              2

### Task - 4

In [20]:
df.isnull().any()

Random value 1    False
Random value 2    False
Random value 3     True
Random value 4    False
dtype: bool

### Task - 5

In [21]:
df.loc[0:,'Random value 2']

0    2011
1    2011
2    2015
3    2019
Name: Random value 2, dtype: object

In [22]:
df.iloc[0:,1]

0    2011
1    2011
2    2015
3    2019
Name: Random value 2, dtype: object

In [23]:
df.loc[0:,'Random value 3']

0     8.51
1    11.88
2    19.20
3      NaN
Name: Random value 3, dtype: object

In [24]:
df.iloc[0:,2]

0     8.51
1    11.88
2    19.20
3      NaN
Name: Random value 3, dtype: object